export default {
  kursk: {
    title: 'Курск',
    lead:
      'Курск — это тот же Белгород, но если отмотать время до двухтысячного года, добавить трамваи и в три раза увеличить количество торговых центров, перепадов рельефа и старых зданий. Я бы не хотел жить в Курске, но уверен, что в нём вполне себе можно жить.',
    contents: [
      {
        caption:
          'Прикольно, что по пути в Курск мой автобус попал в аварию, а выслать за нами новый почему-то не выслали.',
        picture: { source: '/travel/russia/kursk/wreck.jpg', width: 1280, height: 960 },
      },
      {
        caption: 'Ильич указывает путь.',
        picture: { source: '/travel/russia/kursk/lenin.jpg', width: 1280, height: 720 },
      },
      {
        caption:
          'Идёшь по курской улице, а на тебя с крыши смотрит орден Великой отечественной войны.',
        picture: { source: '/travel/russia/kursk/ussr.jpg', width: 1280, height: 720 },
      },
      {
        caption:
          'Идёшь по курской улице, а тебе навстречу торговый центр, аварийка, торговый центр, совок, торговый центр, старинная усадьба, торговый центр, совок.',
        picture: { source: '/travel/russia/kursk/building.jpg', width: 569, height: 1080 },
      },
      {
        caption: 'Курск — город затерявшихся кавычек.',
        picture: { source: '/travel/russia/kursk/typography.jpg', width: 1280, height: 720 },
      },
      {
        caption:
          'Курский музей археологии мне показался неплохим, а вот планетарий был самой большой тратой времени за последние не знаю сколько лет.',
        picture: { source: '/travel/russia/kursk/skeleton.jpg', width: 1280, height: 720 },
      },
      {
        caption:
          'Традиционно последняя фотка итога города — это городские утки, но в Курске они мне не встретились, поэтому пусть будет мост с надписью ШО ТЫ.',
        picture: { source: '/travel/russia/kursk/bridge.jpg', width: 1280, height: 720 },
      },
    ],
  },

  tula: {
    title: 'Тула',
    lead:
      'Тула — это как Белгород, но если отмотать время до двухтысячного года и добавить трамваи. Всё очень убогое даже на центральных улицах, жить бы здесь вообще не хотел.',
    contents: [
      {
        caption: 'Таких разных пряников с таким большим количеством начинки в жизни не видал.',
        picture: { source: '/travel/russia/tula/pryanik.jpg', width: 702, height: 1080 },
      },
      {
        caption:
          'Даже тульские дома похожи на пряники. На фотке замечен неопознанный летающий палец.',
        picture: { source: '/travel/russia/tula/building.jpg', width: 1280, height: 720 },
      },
      {
        caption:
          'Тульский музей оружия выбесил меня всеми возможными способами: в автоматах нет безнала, навигация ужасная, информация скучная, сенсорные панели реагируют с третьего нажатия. Симулятор вертолёта настолько убог, что не даёт даже разбиться.',
        picture: { source: '/travel/russia/tula/shilka.jpg', width: 1280, height: 960 },
      },
      {
        caption:
          'И тем не менее музей оружия замечателен тем, что я увидел кучу стволов, которые раньше видел только на картинках, а некоторые даже покрутил в руках.',
        picture: { source: '/travel/russia/tula/abakan.jpg', width: 1280, height: 720 },
      },
      {
        caption: 'Это «Вал» и «Винторез».',
        picture: { source: '/travel/russia/tula/as-vss.jpg', width: 1280, height: 720 },
      },
      {
        caption: 'Суровый тульский динозавр.',
        picture: { source: '/travel/russia/tula/dinosaur.jpg', width: 720, height: 1280 },
      },
      {
        caption: 'По традиции последняя фотка — утки.',
        picture: { source: '/travel/russia/tula/ducks.jpg', width: 1280, height: 720 },
      },
    ],
  },

  voronezh: {
    title: 'Воронеж',
    lead:
      'Воронеж — это примерно тот же Белгород, но если отмотать время на две тысячи десятый год, взять каждый квадратный километр и в два-три раза увеличить количество всего: количество людей, магазинов, зданий, этажей. Мне очень понравилось, что Воронеж стоит на большой реке, понравилась «Гото Предестинация», пароходы, паруса, мосты. Воронеж — не супер ухоженный город, местами прям провинция, особенно за рекой, но мне было прикольно. Когда город идеально вылизан до состояния музея, он теряет живость в моих глазах, чувствуешь что он не твой, а какой-то государственный. В Воронеже такого нет, тут всё родное, русское, грязное.',
    contents: [
      {
        caption:
          'Тащусь от вывесок типа «Бешеная табуретка», «Всё будет хорошо», «Центр лечения боли».',
        picture: { source: '/travel/russia/voronezh/shaurma.jpeg', width: 1280, height: 720 },
      },
      {
        caption:
          '«Божье провидение» или «Гото Предестинация» — замечательный памятник и наверняка замечательный музей, но я не попал внутрь из-за пандемии.',
        picture: { source: '/travel/russia/voronezh/ship.jpeg', width: 607, height: 1080 },
      },
      {
        caption:
          'Типичный вид на воронежскую дорогу: ничего не видно из-за ряда припаркованных машин.',
        picture: { source: '/travel/russia/voronezh/car.jpeg', width: 1280, height: 720 },
      },
      {
        caption:
          'От океанариума веет такой аурой, будто живность пачками запихали в эти клетки, чтобы навариваться на туристах.',
        picture: { source: '/travel/russia/voronezh/bird.jpeg', width: 607, height: 1080 },
      },
      {
        caption:
          'Из-за пандемии я не попал на линейный корабль, за то прокатился около него на каком-то прогулочном судне.',
        picture: { source: '/travel/russia/voronezh/me.jpeg', width: 1280, height: 960 },
      },
      {
        caption: 'Воронежский фонарный столб.',
        picture: { source: '/travel/russia/voronezh/wires.jpeg', width: 810, height: 1080 },
      },
      {
        caption: 'Воронеж — город правильных кавычек.',
        picture: { source: '/travel/russia/voronezh/typography.jpeg', width: 1280, height: 720 },
      },
      {
        caption: 'Воронежская утка.',
        picture: { source: '/travel/russia/voronezh/duck.jpeg', width: 1280, height: 684 },
      },
    ],
  },
}
