<template>
  <div id="to-self">
    <Spread number="" content="splash">
      <picture>
        <source
          media="(orientation:portrait)"
          srcset="
            https://vsevoland-spaces.fra1.cdn.digitaloceanspaces.com/on-self/on-self.png
          "
        />
        <source
          media="(orientation:landscape)"
          srcset="
            https://vsevoland-spaces.fra1.cdn.digitaloceanspaces.com/on-self/on-self-landscape.png
          "
        />
        <img
          src="https://vsevoland-spaces.fra1.cdn.digitaloceanspaces.com/on-self/on-self.png"
        />
      </picture>
    </Spread>

    <Spread number="2">
      <Page>
        <Heading2 inner="Вступление" />
        <Paragraph no-indent="true" inner="…" />
      </Page>
      <Page> </Page>
    </Spread>

    <Spread number="3">
      <Page>
        <Thought
          title="For the love of it"
          text="Не существует добра и зла, рая и ада, бога и дьявола, чёрного и белого, правильного и неправильного. Существуют мнения, намерения, действия, последствия. Пусть твои действия будут продиктованы твоей любовью."
        />

        <Thought
          title="Whatever lets you sleep at night"
          text="Кто-то не считает денег, у кого-то тёплые отношения, кого-то любят во всём мире, кто-то пронзает небеса своими делами — в таком окружении невольно начинаешь сравнивать себя с другими и испытывать неудовольствие от этого, но с обретением внутреннего покоя понимаешь, что it’s all the same shit."
        />

        <Thought
          title="Ответ содержится в вопросе"
          text="Ты спросишь: «В чём смысл жизни, почему никто не может дать мне ответа?» Я скажу: «Потому что это не вопрос, который ты задаёшь жизни, а вопрос, который жизнь задаёт тебе»."
        />

        <Thought
          title="It’s you I like"
          text="Фред Роджерс любил людей такими, какие они есть, и в этом его великая мудрость."
        />
      </Page>
      <Page>
        <Thought
          title="Глубина восприятия"
          text="Ты настолько любишь жизнь, что тебе сложно представить хоть какое-то её проявление, в котором ты не смог бы найти хоть немного красоты, если бы захотел. Если дать кому-нибудь коснуться этой части тебя, то скорее всего человек испугается утонуть в такой глубине восприятия, повесит на тебя каких-нибудь ярлыков и поспешит скорее вернуться в свой простой и понятный мир. Что тебе до этого? Ищи людей, с которыми можно померяться глубиной восприятия, но желательно ещё чтоб они были при том здоровыми духом."
        />

        <Thought
          title="F.I.L.O."
          text="Knowledge of self shines brighter than all — так сказал Шинго Аннен."
        />

        <Thought
          title="Ожидания"
          text="Один из главных секретов счастья: не имей ожиданий. Когда ты ожидаешь от человека каких-то действий, ты совершаешь преступление против красоты мира."
        />
      </Page>
    </Spread>
    <Spread number="4">
      <Page>
        <Thought
          title="Фу позор"
          text="«Опозорить», «предать», «подвести» — эти слова люди используют в моменты, когда они понимают как мало от них зависит, но не могут позволить другим людям тоже это понять."
        />

        <Thought
          title="Наука называть"
          text="Почему ты так любишь Ницше? Потому что он круто умел придумывать названия книгам: «Человеческое, слишком человеческое: книга для свободных духом», «Весёлая наука», «Так говорил Заратустра: книга для всех и ни для кого», «По ту сторону добра и зла: прелюдия к философии будущего», «Падение кумиров: как филосовствовать молотом», «Антихрист», «Се человек: как становятся собой», «Воля к власти: попытка переоценки ценностей»."
        />

        <Thought
          title="Гендеры в сексе"
          text="Чем дольше ты живёшь, тем дальше ты от традиционных гендеров. Ты видишь красоту в сексе мужчин настолько же, насколько и в сексе женщин, насколько и в сексе между мужчиной и женщиной. Можешь ли ты представить себя занимающимся сексом с парнем? Да, потому что нет ничего, что ты не можешь представить. А хочешь ли ты заниматься сексом с парнями? Нет, тебе больше нравятся девушки."
        />
      </Page>
      <Page>
        <Thought
          title="Союз творцов"
          text="Веками семья была союзом мужчины и женщины, но тёмные времена проходят, теперь пусть семья будет союзом творцов, которые хотят своим союзом обогатить мир."
        />

        <Thought
          title="Мгновение"
          text="Марк Аврелий писал, что у человека нет ничего кроме мгновения. Про эту истину говорили многие. Возможно, что это самая великая из всех истин. Любопытны многочисленные следствия, к примеру, бессмысленность накопления чего-либо ради самого факта накопления, а ещё совсем удивительно: нет особой разницы между жизнью длиной в год и жизнью длиной в сто лет, потому что в обоих жизнях по сути есть только мгновение."
        />

        <Thought
          title="Краткий пересказ стоицизма"
          text="В мире есть вещи, которые от тебя не зависят, не стоит из-за них тревожиться, а вместо этого следует обращать внимание на зависящее от тебя — твоё к ним отношение. Об этом писал ещё Эпиктет."
        />
      </Page>
    </Spread>
    <Spread number="5">
      <Page>
        <Thought
          title="Стоики о болезнях"
          text="Если с тобой случилось что-то неприятное, то не стоит тревожиться по этому поводу, а вместо этого следует думать шире и считать, что всё происходящее является частью естества. Если у тебя болит зуб, то можно испытывать неприятные ощущения от того что он физически болит, но не от того что с тобой случилась эта неприятность."
        />

        <Thought
          title="Memento mori"
          text="Удивительное дело: ты готов умереть в любой момент. Из чего это растёт, из безумия? Скорее из внутреннего покоя."
        />

        <Thought
          title="Стоики о людях"
          text="Тебе будут встречаться люди самые разные, часто они будут вызывать у тебе неприятные эмоции, но в твоих силах помнить, что все люди часть одного естества, от этого тебе будет легче контролировать свои эмоции."
        />

        <Thought
          title="Самое большое благо"
          text="Существует ли большее благо, чем мир с собой, внутренний покой, умение не теряя себя пройти через что угодно?"
        />
      </Page>
      <Page>
        <Thought
          title="Maybe on Earth, maybe in the future"
          text="Blame — произведение с большой буквы. Оно сильно расширяет фантазию, потому что такие привычные вещи как время и жизнь там особо не имеют значения. Сейчас все упарываются в быстрый экшен и диалоги, а тут бывает героям приходится по 800 часов ждать, пока они доедут из точки А в точку Б, такое мало где увидишь."
        />
        <Thought
          title="You are special"
          text="Список того, чему ты научился у Фреда Роджерса: 1. Каждый человек особенный без каких-либо причин, особенный просто потому что другого такого больше нет. 2. Ты должен уметь любить себя и не стесняться этого, если хочешь уметь по-настоящему любить других людей. 3. Любить надо без каких-либо условий, не за достижения, не за крутость или красоту, а просто потому что. 4. Здорово уметь останавливаться когда зол, чувствовать контроль над собой."
        />
      </Page>
    </Spread>
    <Spread number="6">
      <Page>
        <Thought
          title="С миру по нитке"
          text="Ты любишь Гермеса из Kino no Tabi, это мотоцикл модели «Бруф Супериор». Ещё ты очень уважаешь Томаса Лоуренса, английского агента времён Первой мировой, автора книги «Семь столпов мудрости». Оказывается, Томас Лоуренс за жизнь был владельцем восьми мотоциклов «Бруф Супериор». Такие открытия греют душу. Приятно знать, что какое-то совершенно безумное количество событий должно было случиться, чтобы до тебя долетел этот маленький факт из истории вселенной: у двух важных для тебя людей были одинаковые мотоциклы. Взять, к примеру, автора и художника Kino no Tabi. Они могли не париться с деталями, Гермес мог быть просто мотоциклом, но нет, они сделали его именно реальным мотоциклом. А кто-то ещё обнаружил это и записал в интернете на сайте. А кто-то создал этот сайт. А кто-то сфоткал Лоуренса. А кто-то нашёл эту фотку и оцифровал. А кто-то вставил на сайт фотку с мотоциклом и подписал, какой модели этот мотоцикл и сколько их было у Лоуренса. В конце цепочки стоишь ты и видишь в ней отрывки жизней других людей, которых ты и знать не знаешь, но они все немного причастны к тому, что тебе дорого. Это совершенно удивительно и восхитительно."
        />
      </Page>
      <Page>
        <Thought
          title="The girl who collects cockroaches"
          text="Ты встретил видос о девочке, у которой в комнате живут тысячи питомцев-тараканов. Почему в коментах ни одна душа не выступает за девочку? Ты бы спокойно отнёсся к таракану, ползающему по тебе и даже по лицу, при условии что он достаточно большой и не залезет в ноздри или уши. Можешь ли ты вспомнить хоть одно животное, к которому ты испытываешь отвращение или испытывал бы отвращение, если бы животное ползало по тебе? Допустим, если оно может укусить или тем более убить тебя — вот такое животное ты бы не хотел на себе, но даже так ты можешь представить ситуации, когда ты бы переборол этот страх. Разве не замечательно представлять себя авианосцем, когда по тебе ползают летучие жуки?"
        />

        <Thought
          title="Now you see me"
          text="Одна из главных мудростей: всё решает восприятие. Если ты назовёшь себя художником и убедишь в этом окружающих, то какая разница, что ты не умеешь рисовать?"
        />
      </Page>
    </Spread>
    <Spread number="7">
      <Page>
        <Thought
          title="The one thing I’ve always had is good luck"
          text="На второй день поисков ты снял однокомнатную квартиру в Москве без посредников, ковров на стенах, славян в описании, вырвиглазных или лишних элементов интерьера, тебя никто не кинул, вся мебель работает, не первый и не последний этаж, в четырёхстах метрах метро, в пятиста метрах заповедник «Царицыно». А что предрекали твои знакомые?"
        />

        <Thought
          title="Женские проблемы"
          text="Есть вопросы, о которых тебе хочется поговорить, к примеру пуританское отношение к порнографии, которое так распространено среди девушек, но ты этого не делаешь, потому что опасаешься что твой вопрос может навредить какой-нибудь девоньке, которую колбасит в вопросах гендеров и сексуальности. Ты спросишь: «Смотришь ли ты порно?» Она подумает, что если она скажет да, то ты посчитаешь её развратной, поэтому вопрос добавит в копилку её лжи ради социального одобрения. Ты спросишь: «Почему ты не смотришь порно?» Она подумает, что ты упрекаешь её в неправильности, поэтому вопрос добавит в копилку её внутренних комплексов. Ты можешь ещё по-всякому спросить, но ты этого не делай, потому что тебе это научный интерес, а для неё это проблема отношения к себе, жизни и обществу. Это применимо и в других вопросах."
        />
      </Page>
      <Page>
        <Thought
          title="Зомбированные"
          text="Многие, очень многие люди попадают в ловушку ошибочного убеждения, что они должны добиться успеха или совершить какие-то другие действия, чтобы они были молодцами, а их жизни считались прожитыми не зря. Почему-то считается, что сама жизнь имеет мало ценности, считается, что именно достижения делают её стоящей. Почему-то неприлично сказать, что тебя ни капли не расстроит, если ты не станешь лучшим разработчиком в мире, не устроишься в лучшую компанию во вселенной и вообще в принципе до самой смерти пробудешь таким, какой ты есть сейчас."
        />

        <Thought
          title="Простые истины"
          text="Желаю тебе жить в мире, в котором все люди понимают следующее: 1. Человек не обязан добиться успеха, потому что это не обязательно. 2. Человек не обязан читать по книге в месяц и внедрять по привычке в неделю, потому что это не обязательно. 3. Жизнь не бывает прожитой не так, потому что жизнь не бывает прожитой не так никогда. 4. Самое главное в жизни человека — это то, что человек считает самым главным в своей жизни. 5. Самое страшное в жизни человека — это то, что человек считает самым страшным в своей жизни."
        />
      </Page>
    </Spread>
    <Spread number="8">
      <Page>
        <Thought
          title="Не такой как все"
          text="Люди, которые любят не обращать внимание на мнения других, часто оказываются больнее тех, кто любит обращать внимание на мнения других. Они говорят: не важно что о тебе думают, не важно что о тебе говорят, будь не как все. Это красивые слова и шаг в очень хорошую сторону, потому что общество действительно слишком много себе позволяет, но не всегда эти слова растут на почве внутреннего покоя, часто они растут из комплексов. Что следует из этого? Означает ли это, что их не нужно слушать? Конечно не означает! Делай как хочешь. Я люблю тебя таким, какой ты есть, вне зависимости от того, такой ли ты как все или не такой как все."
        />

        <Thought
          title="All the way"
          text="«Небо бескрайнее, потому что отражает мою душу» — с этих слов начинается Kino no Tabi. Возможно это самые красивые слова, которые ты слышал в жизни."
        />

        <Thought
          title="Душевная пустота"
          text="В твоём случае пустота в душе — это не когда чего-то не хватает, а когда есть свободное место для чего-то. Возможно что для пустоты."
        />
      </Page>
      <Page>
        <Thought
          title="Нации"
          text="Красив мир, полный разных наций. Но и мир без наций тоже красив. Приятно окунуться в традиции далёких народов. Но приятно и знать, что везде ты встретишь таких же людей, как ты. Иногда тебе хочется, чтобы не было разных наций, стран и языков, чтоб всё было одним большим человечеством. Это очень красивая мечта, хотя мир разных стран тоже красив."
        />

        <Thought
          title="Шёпот призрака"
          text="Умей читать между строк и доверять своему чутью. Люди будут навязывать тебе свои взгляды и требовать рационального поведения, но это всё манипуляции или заблуждения. Твои чувства важны и ничем не хуже любых данных и чувств других людей."
        />

        <Thought
          title="Себе на уме"
          text="Безоговорочное подчинение начальнику — иллюзия, от которой быстро избавляешься, снова и снова расплачиваясь за его слабости."
        />
      </Page>
    </Spread>
    <Spread number="9">
      <Page>
        <Thought
          title="Навязчивый буддизм"
          text="Есть большая разница между счастьем и удовольствием. Есть большая палка для тех, кто захочет убедить тебя в том, что что-то из этого важнее другого."
        />

        <Thought
          title="Ненавязчивый буддизм"
          text="Между болью и страданием такая же разница, как между удовольствием и счастьем."
        />

        <Thought
          title="The abyss gazes also into you"
          text="Есть красота в том, чтобы коснуться души человека и почувствовать, как мало в ней пустоты в сравнении с твоей. Встречал ли ты когда-нибудь человека, в чьей душе было бы столько же пустоты?"
        />

        <Thought
          title="Will they hold the wall or will the city fall?"
          text="Исход сражения известен до его начала, иначе не бывает. Понять это невозможно, это возможно только прочувствовать: крылатые гусары не разворачивают стол, они показывают как он стоит. Помни и другое: кого ебёт исход сражения? Беспокойся о победах и поражениях только тогда, когда твоя любовь к ним сильнее любви к сражению."
        />
      </Page>
      <Page>
        <Thought
          title="My powers have doubled since the last time we met"
          text="Есть большая красота в том, чтобы умножить на ноль более слабого противника. Нанося сокрушительное поражение более слабому противнику, ты проявляешь к нему любовь, ты даёшь ему коснуться своего искусства, надеясь что возможно он чему-то научится и вы ещё встретитесь."
        />

        <Thought
          title="True dharma"
          text="Одна из важнейших мудростей: слушай советов только тех, на кого хочешь быть похожим. Помни ещё, что чем мудрее человек, тем менее он склонен давать советы. И ещё помни: люди бывают ебанутыми."
        />

        <Thought
          title="The bird of Hermes is my name"
          text="Есть большая красота в том, чтобы сражаться с равным противником ноздря в ноздрю. Вселенная замирает и время изменяет своё русло, когда сражаются два равных противника."
        />
      </Page>
    </Spread>
    <Spread number="10">
      <Page>
        <Thought
          title="Me, myself and I"
          text="«Самый великий дар, который ты можешь подарить, это твоё искреннее я». Так говорил Фред Роджерс."
        />

        <Thought
          title="Мы с тобой одной крови"
          text="Помни, что люди — это комки страхов, ошибок, слабостей. Бывают люди, которые выглядят как супермены, но не стоит считать, что они на самом деле супермены, часто они просто хорошо создают такое впечатление в глазах тех, кто верит в суперменов. Познакомься с десятком суперменов и узнаешь, что между вами нет особой разницы. Стань суперменом для кого-то и поймёшь, насколько бессмысленно верить в суперменов."
        />

        <Thought
          title="Молодым везде у нас дорога"
          text="Генри Торо писал: «Возраст годится в наставники не больше, если не меньше, чем юность, ведь он не столькому научился, сколько утратил». Мудрость этих слов невъебическая, научись должным образом относиться ко всем желающим поучить тебя жизни, особенно если они старше тебя и тем более если они старее тебя."
        />
      </Page>
      <Page>
        <Thought
          title="Паладин имени своих принципов"
          text="Высоко цени в человеке волю иметь в работе принципиальное мнение и идти против того, как делают все вокруг. Много кто скажет что есть большая глупость в принципиальности в работе, но из их числа прислушивайся только к тем, которые не боятся быть уволенными."
        />

        <Thought
          title="Прокрастинация нежеланного"
          text="Когда какое-то дело просит тебя заставлять себя делать его, помни что скорее всего это происходит по той причине, что ты делаешь что-то нежеланное для тебя. Много раз в жизни ты пытался начать качаться из приличия или желания подражать другим, но не бросить ты смог только тогда, когда всей душой полюбил своё тело и стал чувствовать счастье от заботы о нём и от взаимопонимания между телом и душой."
        />

        <Thought
          title="Наши желания не всегда совпадали"
          text="Большое счастье общаться с людьми, которые смотрят на мир иначе. Счастье также общаться и с теми, которые смотрят на мир во многом как ты."
        />
      </Page>
    </Spread>
    <Spread number="11">
      <Page>
        <Thought
          title="Страна советов"
          text="Когда ты спрашиваешь у людей советов, помни что их советы лишь мнения, а не инструкции к действию. Помни также, что эти люди не знают ситуацию и на десятую часть от того, насколько её знаешь ты, ведь они не ты и у них за плечами нет твоего жизненного пути и твоих взглядов, им доступны лишь несколько капель от того океана, который на самом деле тебя окружает. В ответ на просьбу посоветовать люди станут воображать, а ты станешь слушать их воображения, оценивать насколько они тебе милы и согласишься ли ты взять какие-то кусочки их воображений на вооружение."
        />

        <Thought
          title="Не всем дано"
          text="Есть большая красота в том, чтобы уметь любить своих врагов и уметь ненавидеть своих друзей."
        />

        <Thought
          title="Мудрость естества"
          text="Марк Аврелий писал, что ни один человек не может сделать тебе зла, потому что ни один человек не может сделать тебя в меньшей мере частью естества, чем ты был до этого. Это трудно понять, но когда понимаешь, то жизнь становится легче и приятнее."
        />
      </Page>
      <Page>
        <Thought
          title="For the faith, for the way of the sword"
          text="Есть большая красота в том, чтобы сражаться до последней капли крови. Иногда ты оказываешься в ситуации, в которой ты не сможешь победить. Что делать в такой ситуации — твой выбор, в котором много вариантов с разными последствиями, но сражаться до последнего вздоха всегда как минимум красив."
        />

        <Thought
          title="Делай как говорю"
          text="Сколько раз в жизни учителя отбивали у тебя желание заниматься каким-либо искусством? Сколько раз учителя выдавали свои ошибки за свои знания, а свои страхи за свою мудрость? Держи от себя на порядочном расстоянии так называемых учителей, а ещё дальше держи тех, кто хочет учить тебя из любви к своему искусству, а не из любви к твоему искусству."
        />

        <Thought
          title="Наш крест"
          text="Торо писал, что не знает ни одного человека, который обладал бы настолько свободным умом, что в его присутствии можно было бы думать вслух. В этом вся твоя жизнь."
        />
      </Page>
    </Spread>
    <Spread number="12">
      <Page>
        <Thought
          title="Die fröhliche Wissenschaft"
          text="Известная цитата:
        «Каждый миг живи как последний». Она очень красива и страшна, но от неё
        мало пользы, потому что в ней умалчивается про годы психологической
        подготовки, необходимые чтобы проживать каждый миг как последний. Ищущим
        экзистенциальной мудрости предлагай такую цитату:&nbsp;«»."
        />

        <Thought
          title="Миры"
          text="Есть много миров: мир материальный, мир внутри тебя, мир внутри каждого другого человека. Есть красота в том, чтобы жить во многих мирах сразу, но пока что я не видел примера красоты того, чтобы жить только в одном мире."
        />

        <Thought
          title="Ослы о красоте"
          text="«Красота в глазах смотрящего» — эту простую истину знает любой художник, фотограф, косплеер, модель и другие люди, для которых образ такой же инструмент, как отвёртка. Если ты считаешь, что ты некрасив, у тебя есть три пути: ничего не делать, изменить свою внешность в сторону красоты или изменить свои вкусы в сторону своей внешности. Если кто-то скажет, что что-то из этого предпочтительнее другого, то этот человек осёл."
        />
      </Page>
      <Page>
        <Thought
          title="Мотивация предпринимателей"
          text="Предпринимателей уважай за их волю действовать без инструкций, не плыть по течению, рисковать, жить своим делом. Однако не стоит считать, что всё это растёт из жизненной мудрости, часто это растёт из желания быть не как все. Нет особой разницы между желаниями быть как все и быть не как все."
        />

        <Thought
          title="Персоно-центрированный подход"
          text="Суть психотерапии не в том, чтобы стать терминатором, а в том, чтобы перестать в ней нуждаться."
        />

        <Thought
          title="Happiness"
          text="Культ успеха сам по себе не является добром или злом. Является ли он злом, когда безвольному человечку со всех сторон вдалбливают превозмогать и бежать вверх по карьерной лестнице, заставляя его тем самым страдать и колбаситься как белка в колесе, когда он предпочёл бы позадротить в дотан под чипсики и колу? Даже в этом случае культ успеха не является злом, ведь такому человеку какая разница за какими обманами гоняться?"
        />
      </Page>
    </Spread>
    <Spread number="13">
      <Page>
        <Thought
          title="Ok, boomer"
          text="Не стоит считать, что любой бумер обязательно высокомерен, но в важных вещах стоит держать каждого из них на порядочном расстоянии, пока не докажет обратного."
        />

        <Thought
          title="Ok, millenial"
          text="Милениалов уважай за то, что они росли в переломное время и во многом подготовили почву для зетов, но держи в голове и то, что многие из них не справились со своими испытаниями и превратились в помолодевших бумеров."
        />

        <Thought
          title="Gen Z, bitch"
          text="Большое счастье быть из поколения зетов. В среднем в зетах гораздо больше свободы и гораздо меньше булщита, чем в более взрослых поколениях. Лучшее что можно пожелать зетам — освободиться скорее от влияния старших поколений, особенно от их больного ожидания, что зетам предстоит решить проблемы, созданные бумерами."
        />

        <Thought
          title="Adeptus Tiktokus"
          text="Поколение альф — маленькие миленькие покемоши, с которыми у зетов куда больше понимания, чем у любых двух других поколений. Когда зеты недовольны культурой тиктока или недалёким вкусом альф в отношении контента на ютубе, зетам следует заткнуться нахуй. Что может быть прекраснее, чем со скином Хиробрина пугать альф в майнкрафте? Милениалам с их экзистенциальными кризисами сейчас не до этого, а бумеров с их нулевой эмпатией и закостенелыми ценностями вообще лучше не подпускать к альфам."
        />
      </Page>
      <Page>
        <Thought
          title="Надо резать"
          text="Однажды некий шарик появился у тебя под кожей в пальце. Ты пошёл к хирургу, на что хирург сказал: «Надо резать». Ты был не готов резать, поэтому пошёл ещё к терапевту, который сказал так: «Надо мазать». В тот момент ты осознал, что у каждого своя истина, а выбират тебе и расплачиваться тоже тебе."
        />

        <Thought
          title="This book loves you"
          text="«Жить вообще трудно, так чего ты ждёшь от цитаты?» — цитата из книги Пьюдипая."
        />

        <Thought
          title="Аскеты"
          text="Аскетичность уважай тогда, когда она растёт из сильного духа, а не из душевных болезней."
        />

        <Thought
          title="Стилисты"
          text="Стилисты нужны тем, кто хочет выглядеть как принято, как нравится людям, как нравится стилистам. Кто хочет выглядеть как они сами хотят, лучше пусть обращаются к другим специалистам: самим себе."
        />

        <Thought
          title="Психотерапевты"
          text="Психотерапевты — герои нашего времени."
        />
      </Page>
    </Spread>
    <Spread number="14">
      <Page>
        <Thought
          title="Клиентский сервис"
          text="Ильяхов ещё хуй знает когда объяснил всем, что такое клиентский сервис, а компании типа dodopizza.ru показали это на практике. Почему же до сих пор столько уебанского сервиса? Вопрос для самостоятельного изучения."
        />

        <Thought
          title="Больные люди"
          text="Не существует ничего более омерзительного, чем родить ребёнка для себя. Омерзительно также развестись и оставить ребёнка без себя. Взрослые с мерзкими ебалами будут причмокивая рассказывать о том, насколько развод был важен для их ментального здоровья, насколько тебе этого не понять и насколько они тем самым сделали кому-то там лучше, но не существует взрослых, чьи слова о разводе не были бы похожи на потоки гноя, льющиеся из их половых органов."
        />

        <Thought
          title="Сами виноваты"
          text="Безусловное уважение к родителям — иллюзия, от которой быстро освобождаешься, снова и снова расплачиваясь за их ошибки."
        />
      </Page>
      <Page>
        <Thought
          title="Caro mi è il sonno, e più l’esser di sasso"
          text="Ergo Proxy — произведение с большой буквы. В нём все персонажи как родные. Считай это мерилом качества сюжета: все персонажи должны быть как родные."
        />

        <Thought
          title="And you don’t seem to understand"
          text="Serial Experiments Lain — произведение с большой буквы. В отличие от классического трансгуманизма, который показан в Ghost in the Shell, здесь трансгуманизм своего рода эзотерический. Как говорил Шопенгауэр, настоящая задача не в том, чтобы написать о чём-то неизвестном, а в том, чтобы написать о чём-то известном так, как ещё никто не писал."
        />

        <Thought
          title="Новости"
          text="Когда ты последний раз читал новости? Когда отравили Навального. А перед этим? Когда случился коронавирус. А до того? Кажется когда была олимпиада в Сочи"
        />
      </Page>
    </Spread>
    <Spread number="15">
      <Page>
        <Thought
          title="Кому-то так проще"
          text="«Относись к другим так, как хочешь, чтоб они относились к тебе» — это такое же красивое и больное заблуждение, как и «Каждый миг проживай как последний». Причина в том, что это высказывание создаёт ложное впечатление, будто в ответ люди будут относиться к тебе так, как ты относишься к ним. Для ищущих социальной мудрости есть такое высказывание: «Относись к другим так, как хочешь»."
        />

        <Thought
          title="Почва"
          text="Марк Аврелий просто и понятно объяснил, почему не стоит искать известности, но важно понимать, что его отношение к известности выросло на той же почве, на которой выросло его убеждение в необходимости достойно блюсти свой гражданский долг. Угадай, что вырастет из семян отношения к известности, если посадить их в почву любви к себе и жизни?"
        />

        <Thought
          title="Знаменитости"
          text="Знаменитость — человек, о существовании которого знает больше людей, чем о других людях. Это единственная разница между знаменитостью и тобой."
        />
      </Page>

      <Page>
        <Thought
          title="В поисках указателей"
          text="Заблуждаются люди, которые говорят, что в жизни нужны цели, принципы, ориентиры, примеры для подражания, вызовы, достижения, захватывающие моменты. Это сложно понять, многие люди не понимают этого всю свою жизнь, но истина очень проста: каждый дрочит на что хочет."
        />

        <Thought
          title="Срок годности"
          text="Читая чужие мысли, особенно философские, помни что у автора всегда есть контекст, который тебе неизвестен. К примеру, Марк Аврелий был императором Рима, отсюда и его склонность блюсти свой долг. Цунетомо Ямамото жил в феодальной Японии, а ценности тех времён поразительно отличались от ценностей современных людей. Проверяй у мыслей не только качество, но ещё и срок годности."
        />

        <Thought
          title="Отцы и дети"
          text="Ницше писал, что философия рождается от праздности, но если праздность мать философии, то отцом является тяжёлый жизненный путь, как и у психотерапии."
        />
      </Page>
    </Spread>
  </div>
</template>

<script>
import Page from '@/components/book/Page.vue'
import Spread from '@/components/book/Spread.vue'
import Thought from '@/components/book/ToSelf/Thought.vue'

export default {
  layout: 'book',
  components: {
    Page,
    Spread,
    Thought,
  },
  head() {
    return {
      title: 'Про себя, или Размышления на унитазе',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content:
            'Краткий пересказ моего мировоззрения, в чём смысл жизни, как жить, как должно поступать в разных ситуациях, написано в значительной мере сидя на унитазе',
        },
      ],
    }
  },
}
</script>

<style lang="scss">
@import 'assets/css/abstracts/_variables.scss';
@import 'assets/css/abstracts/_mixins.scss';

@include media-breakpoint-up($width-md) {
  .page {
    margin-bottom: -$one-line;
  }
}
</style>
