<template>
  <div>
    <Spread
      v-for="(spread, spread_index) in contents.spreads"
      :key="spread_index"
      :number="spread.number"
    >
      <Page v-for="(page, page_index) in spread.pages" :key="page_index">
        <Aphorism
          v-for="(aphorism, aphorism_index) in page.aphorisms"
          :key="aphorism_index"
          :title="aphorism.title"
          :text="aphorism.text"
        />
      </Page>
    </Spread>
  </div>
</template>

<script>
import Page from '@/components/book/Page.vue'
import Spread from '@/components/book/Spread.vue'
import Aphorism from '@/components/custom/on-self/Aphorism.vue'

const contents = {
  spreads: [
    {
      number: '3',
      pages: [
        {
          aphorisms: [
            {
              title: 'For the love of it',
              text:
                'Не существует добра и зла, рая и ада, бога и дьявола, чёрного и белого, правильного и неправильного. Существуют мнения, намерения, действия, последствия. Пусть твои действия будут продиктованы твоей любовью.',
            },
            {
              title: 'Whatever lets you sleep at night',
              text:
                'Кто-то не считает денег, у кого-то тёплые отношения, кого-то знают во всём мире, кто-то пронзает небеса своими делами — в таком окружении невольно начинаешь сравнивать себя с другими и испытывать неудовольствие от этого, но с обретением внутреннего покоя понимаешь, что it’s all the same shit.',
            },
            {
              title: 'Ответ содержится в вопросе',
              text:
                'Ты спросишь: «В чём смысл жизни, почему никто не может дать мне ответа?» Я скажу: «Потому что это не вопрос, который ты задаёшь жизни, а вопрос, который жизнь задаёт тебе».',
            },
            {
              title: 'It’s you I like',
              text:
                'Фред Роджерс любил людей такими, какие они есть, и в этом его великая мудрость. Говорят, что угонщик на следующий день вернул автомобиль, узнав что его хозяин Фред Роджерс. Найдётся ли в мире другой такой человек? Конечно нет, но не потому что Фред Роджерс самый-самый, а потому что он человек. Каждый человек особенный и неповторимый.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Глубина восприятия',
              text:
                'Ты настолько любишь жизнь, что тебе сложно представить хоть какое-то её проявление, в котором ты не смог бы найти хоть немного красоты, если бы захотел. Если дать кому-нибудь коснуться этой части тебя, то скорее всего человек испугается утонуть в такой глубине восприятия, повесит на тебя каких-нибудь ярлыков и поспешит скорее вернуться в свой простой и понятный мир. Что тебе до этого? Ищи людей, с которыми можно померяться глубиной восприятия, но желательно ещё чтоб они были при том здоровыми духом.',
            },
            {
              title: 'F.I.L.O.',
              text: 'Knowledge of self shines brighter than all — так сказал Шинго Аннен.',
            },
            {
              title: 'Ожидания',
              text:
                'Один из главных секретов счастья: не имей ожиданий. Когда ты ожидаешь от человека каких-то действий, ты совершаешь преступление против красоты мира.',
            },
          ],
        },
      ],
    },
    {
      number: '4',
      pages: [
        {
          aphorisms: [
            {
              title: 'Мгновение',
              text:
                'Марк Аврелий писал, что у человека нет ничего кроме мгновения. Про эту истину говорили многие. Любопытны многочисленные следствия, среди которых самое удивительное следующее: нет особой разницы между жизнью длиной в год и жизнью длиной в сто лет, потому что в обоих жизнях по сути есть только мгновение.',
            },
            {
              title: 'Краткий пересказ стоицизма',
              text:
                'В мире есть вещи, которые от тебя не зависят, не стоит из-за них тревожиться, а вместо этого следует обращать внимание на зависящее от тебя — твоё к ним отношение. Об этом говорил ещё Эпиктет.',
            },
            {
              title: 'На войне как на войне',
              text:
                'Всё самое отвратительное что есть в человечестве, всё это обнажается на войне. Бывают такие войны, как война против рабства в США, благие дела встречается на войне, но они встречается и в вагоне метро. Война в метафизическом смысле отличается от той войны, в которой насилуют женщин, убивают людей и взрывают города. Говоря о войне, помни об этом',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Наука называть',
              text:
                'Почему ты так любишь Ницше? Потому что он круто умел придумывать названия книгам: «Человеческое, слишком человеческое: книга для свободных духом», «Весёлая наука», «Так говорил Заратустра: книга для всех и ни для кого», «По ту сторону добра и зла: прелюдия к философии будущего», «Падение кумиров: как филосовствовать молотом», «Антихрист», «Се человек: как становятся собой», «Воля к власти: попытка переоценки ценностей».',
            },
            {
              title: 'Фу позор',
              text:
                '«Опозорить», «предать», «подвести» — эти слова люди используют в моменты, когда они понимают, как мало от них зависит, но не могут позволить другим людям тоже это понять.',
            },
          ],
        },
      ],
    },
    {
      number: '5',
      pages: [
        {
          aphorisms: [
            {
              title: 'Стоики о болезнях',
              text:
                'Если с тобой случилось что-то неприятное, то не стоит тревожиться по этому поводу, а вместо этого следует думать шире и считать, что всё происходящее является частью естества. Если у тебя болит зуб, то можно испытывать неприятные ощущения от того что он физически болит, но не от того что с тобой случилась эта неприятность.',
            },
            {
              title: 'Memento mori',
              text:
                'Удивительное дело: ты готов умереть в любой момент. Из чего это растёт, из безумия? Скорее из внутреннего покоя. Однако из этого не следует, что ты согласен умереть в любой момент.',
            },
            {
              title: 'Стоики о людях',
              text:
                'Стоики учили, что легче контролировать свои эмоции, когда помнишь, что все люди, даже бесячие, являются частью одного естества. Это правда, но что с того? В той же мере частью естества является и желание побеситься, когда тебя бесят. В конечном счёте просто выбирай то, о чём будешь жалеть в меньшей степени.',
            },
            {
              title: 'Самое большое благо',
              text:
                'Существует ли большее благо, чем мир с собой, внутренний покой, умение не теряя себя пройти через что угодно? Честно говоря, да, такое благо существует. Оно называется вечным возвращением. Подробнее в предпоследней мысли четвёртой части «Весёлой науки» Ницше.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Maybe on Earth, maybe in the future',
              text:
                'Blame — произведение с большой буквы. Оно сильно расширяет фантазию, потому что такие привычные вещи как время и жизнь там особо не имеют значения. Героям периодически приходится по 800 часов ждать, пока они доедут из точки А в точку Б, такое мало где увидишь.',
            },
            {
              title: 'You are special',
              text:
                'Фред Роджерс считал, что каждый человек особенный без каких-либо причин, особенный просто потому что другого такого больше нет. Фред Роджерс считал, что ты должен уметь любить себя и не стесняться этого, если хочешь уметь по-настоящему любить других людей. Фред Роджерс считал, что любить надо без каких-либо условий, не за достижения, не за крутость или красоту, а просто потому что.',
            },
          ],
        },
      ],
    },
    {
      number: '6',
      pages: [
        {
          aphorisms: [
            {
              title: 'С миру по нитке',
              text:
                'Ты любишь Гермеса из Kino no Tabi, это мотоцикл модели «Бруф Супериор». Ещё ты уважаешь Томаса Лоуренса, английского агента времён Первой мировой, автора книги «Семь столпов мудрости». Оказывается, Томас Лоуренс за жизнь был владельцем восьми мотоциклов «Бруф Супериор». Такие открытия греют душу. Приятно знать, что какое-то совершенно безумное количество событий должно было случиться, чтобы до тебя долетел этот маленький факт из истории вселенной: у двух важных для тебя людей были одинаковые мотоциклы. Взять автора и художника Kino no Tabi: они могли не париться с деталями, Гермес мог быть просто мотоциклом, но нет, они сделали его именно реальным мотоциклом. А кто-то ещё обнаружил это и записал в интернете на сайте. А кто-то создал этот сайт. А кто-то сфоткал Лоуренса с мотоциклом. А кто-то нашёл эту фотку и оцифровал. А кто-то вставил на сайт и подписал, какой модели этот мотоцикл и сколько их было у Лоуренса. В конце цепочки стоишь ты и видишь в ней отрывки жизней других людей, которых ты и знать не знаешь, но они все немного причастны к тому, что тебе дорого. Это совершенно удивительно и восхитительно.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'The girl who collects cockroaches',
              text:
                'Ты встретил видос о девочке, у которой в комнате живут тысячи питомцев-тараканов. Почему в коментах ни одна душа не поддерживает девочку? Ты бы спокойно отнёсся к таракану, ползающему по тебе и даже по лицу, при условии что он достаточно большой и не залезет в ноздри или уши. Можешь ли ты вспомнить хоть одно животное, к которому ты испытываешь отвращение или испытывал бы отвращение, если бы животное ползало по тебе? Это было преступлением против природы. Допустим, если животное может укусить тебя, залезть в тебя или убить тебя — вот такое животное ты бы не хотел на себе, но даже так ты можешь представить ситуации, когда ты бы переборол этот страх. Разве не замечательно играть в авианосца, когда по тебе ползают летучие жуки?',
            },
            {
              title: 'Now you see me',
              text:
                'Одна из главных мудростей: всё решает восприятие. Если ты назовёшь себя художником и убедишь в этом окружающих, то какая разница, что ты не умеешь рисовать?',
            },
          ],
        },
      ],
    },
    {
      number: '7',
      pages: [
        {
          aphorisms: [
            {
              title: 'The one thing I’ve always had is good luck',
              text:
                'На второй день поисков ты снял однокомнатную квартиру в Москве без посредников, ковров на стенах, славян в описании, вырвиглазных или лишних элементов интерьера, тебя никто не кинул, вся мебель работает, не первый и не последний этаж, в четырёхстах метрах метро, в пятиста метрах заповедник «Царицыно». А что предрекали твои окружающие? Четыре в печень за углом вокзала. Помни, что никто не знает что будет дальше. Ещё помни, что ты очень везучий.',
            },
            {
              title: 'Забота о неведении ближних',
              text:
                'Есть вопросы, на которые люди не готовы ответить. Возможно что для тебя эти вопросы научный интерес, а для людей они кошмары, которые не дают спать ночами. Имей мудрость различать такие вопросы и имей любовь не поднимать их в обществе тех, кому это навредит, при условии что ты этого не хочешь конечно же.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Об успехе',
              text:
                'Многие, очень многие люди попадают в ловушку ошибочного убеждения, что они должны добиться успеха или совершить какие-то другие действия, чтобы они были молодцами, а их жизни считались прожитыми не зря. Почему-то считается, что сама жизнь имеет мало ценности, считается, что именно достижения делают её стоящей. Почему-то неприлично сказать, что тебя ни капли не расстроит, если ты не станешь лучшим специалистом в мире, не устроишься в лучшую компанию во вселенной и вообще в принципе до самой смерти пробудешь таким, какой ты есть сейчас.',
            },
            {
              title: 'Простые истины',
              text:
                'Человек не обязан добиться успеха, потому что это не обязательно. Человек не обязан читать по книге в месяц и внедрять по привычке в неделю, потому что это не обязательно. Жизнь не бывает прожитой не так, потому что жизнь не бывает прожитой не так никогда. Самое главное в жизни человека — это то, что человек считает самым главным в своей жизни. Самое страшное в жизни человека — это то, что человек считает самым страшным в своей жизни. Желаю тебе жить в мире, где все понимают эти простые истины.',
            },
          ],
        },
      ],
    },
    {
      number: '8',
      pages: [
        {
          aphorisms: [
            {
              title: 'Не такой как все',
              text:
                'Люди, которые любят не обращать внимание на мнения других, часто оказываются больнее тех, кто любит обращать внимание на мнения других. Они говорят: не важно что о тебе думают, не важно что о тебе говорят, будь не как все. Это красивые слова и шаг в очень хорошую сторону, потому что общество больно много себе позволяет, но не всегда эти слова растут на почве внутреннего покоя, часто они растут из комплексов. Что следует из этого? Означает ли это, что их не нужно слушать? Конечно не означает! Делай как хочешь. Я люблю тебя таким, какой ты есть, вне зависимости от того, такой ли ты как все или не такой как все.',
            },
            {
              title: 'All the way',
              text:
                '«Небо бескрайнее, потому что отражает мою душу» — с этих слов начинается Kino no Tabi. Возможно это самые красивые слова, которые ты слышал в жизни.',
            },
            {
              title: 'Себе на уме',
              text:
                'Безоговорочное подчинение начальнику — иллюзия, от которой быстро избавляешься, снова и снова расплачиваясь за его слабости.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Нации',
              text:
                'Красив мир, полный разных стран, но и мир без стран тоже красив. Приятно окунуться в традиции далёких народов, но приятно и знать, что везде ты встретишь таких людей, которые будут не представителями народов, а представителями одного большого человечества. Это очень красивая мечта, хотя лоскутное одеяло разных стран тоже красиво.',
            },
            {
              title: 'Шёпот призрака',
              text:
                'Умей читать между строк и доверять своему чутью. Люди будут навязывать тебе свои взгляды и требовать рационального поведения, но это всё манипуляции или заблуждения. Твои чувства важны и ничем не хуже любых цифр и чувств других людей. Что касается фактов, то их не существует, существуют только интерпретации, так говорил ещё Ницше.',
            },
            {
              title: 'Душевная пустота',
              text:
                'В твоём случае пустота в душе — это не когда чего-то не хватает, а когда есть свободное место для чего-то. Возможно что для пустоты.',
            },
          ],
        },
      ],
    },
    {
      number: '9',
      pages: [
        {
          aphorisms: [
            {
              title: 'Навязчивый буддизм',
              text:
                'Есть большая разница между счастьем и удовольствием. Есть большая палка для тех, кто захочет убедить тебя, будто что-то из этого важнее другого.',
            },
            {
              title: 'Ненавязчивый буддизм',
              text:
                'Между болью и страданием такая же разница, как между удовольствием и счастьем.',
            },
            {
              title: 'The abyss gazes also into you',
              text:
                'Есть красота в том, чтобы коснуться души человека и почувствовать, как мало в ней пустоты в сравнении с твоей. Встречал ли ты когда-нибудь человека, в чьей душе было бы столько же пустоты?',
            },
            {
              title: 'Will they hold the wall or will the city fall?',
              text:
                'Исход сражения известен до его начала, иначе не бывает. Понять это невозможно, это возможно только почувствовать: крылатые гусары не разворачивают стол, они показывают как он стоит. Помни и другое: кого ебёт исход сражения? Беспокойся о победах и поражениях только тогда, когда твоя любовь к ним сильнее любви к сражению.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'My powers have doubled since the last time we met',
              text:
                'Есть большая красота в том, чтобы умножить на ноль более слабого противника. Нанося сокрушительное поражение более слабому противнику, ты проявляешь к нему любовь, ты даёшь ему коснуться своего искусства.',
            },
            {
              title: 'True dharma',
              text:
                'Одна из важнейших мудростей: слушай советов только тех, на кого хочешь быть похожим. Помни ещё, что чем мудрее человек, тем менее он склонен давать советы. И ещё помни: люди бывают ебанутыми.',
            },
            {
              title: 'The bird of Hermes is my name',
              text:
                'Есть большая красота в том, чтобы сражаться с равным противником ноздря в ноздрю. Вселенная замирает и время изменяет своё течение, когда сражаются два равных противника.',
            },
          ],
        },
      ],
    },
    {
      number: '10',
      pages: [
        {
          aphorisms: [
            {
              title: 'Паладин имени своих принципов',
              text:
                'Высоко цени в человеке волю иметь в работе принципиальное мнение и идти против того, как делают все вокруг. Много кто скажет что на работе есть большая глупость в принципиальности, но из их числа прислушивайся только к тем, которые не боятся быть уволенными.',
            },
            {
              title: 'Прокрастинация нежеланного',
              text:
                'Когда какое-то дело просит тебя заставлять себя делать его, помни что скорее всего это происходит по той причине, что ты делаешь что-то нежеланное для тебя. Много раз в жизни ты пытался начать качаться из приличия или желания подражать другим, но не бросить ты смог только тогда, когда всей душой полюбил своё тело и стал чувствовать счастье от заботы о нём и от взаимопонимания между телом и душой.',
            },
            {
              title: 'Наши желания не всегда совпадали',
              text:
                'Большое счастье общаться с людьми, которые смотрят на мир иначе. Счастье также общаться и с теми, которые смотрят на мир во многом как ты.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Me, myself and I',
              text:
                '«Самый великий дар, который ты можешь подарить, это твоё искреннее я». Так говорил Фред Роджерс.',
            },
            {
              title: 'Мы с тобой одной крови',
              text:
                'Помни, что люди — это комки болезней, травм, страхов, ошибок, слабостей. Бывают люди, которые выглядят как супермены, но не стоит считать, что они на самом деле супермены, часто они просто хорошо создают такое впечатление в глазах тех, кто верит в суперменов. Познакомься с десятком суперменов и узнаешь, что между вами нет особой разницы. Стань суперменом для кого-то и поймёшь, насколько бессмысленно верить в суперменов.',
            },
            {
              title: 'Молодым везде у нас дорога',
              text:
                'Генри Торо писал: «Возраст годится в наставники не больше, если не меньше, чем юность, ведь он не столькому научился, сколько утратил». Мудрость этих слов невъебическая.',
            },
          ],
        },
      ],
    },
    {
      number: '11',
      pages: [
        {
          aphorisms: [
            {
              title: 'Страна советов',
              text:
                'Когда ты спрашиваешь у людей советов, помни что их советы лишь мнения, а не инструкции к действию. Помни также, что эти люди не знают ситуацию и на десятую часть от того, насколько её знаешь ты, ведь они не ты и у них за плечами нет твоего жизненного пути и твоих взглядов, им доступны лишь несколько капель от того океана, который на самом деле тебя окружает. В ответ на просьбу посоветовать люди станут воображать, а ты станешь слушать их воображения, оценивать насколько они тебе милы и согласишься ли ты взять какие-то кусочки их воображений на вооружение.',
            },
            {
              title: 'Друзья и враги',
              text:
                'Есть большая красота в том, чтобы уметь любить своих врагов и уметь ненавидеть своих друзей.',
            },
            {
              title: 'Мудрость естества',
              text:
                'Марк Аврелий писал, что ни один человек не может сделать тебе зла, потому что ни один человек не может сделать тебя в меньшей мере частью естества, чем ты был до этого. Это трудно понять, но когда понимаешь, то жизнь становится легче и приятнее.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'For the faith, for the way of the sword',
              text:
                'Есть большая красота в том, чтобы сражаться до последней капли крови. Иногда ты оказываешься в ситуации, в которой ты не сможешь победить. Что делать в такой ситуации — твой выбор, в котором много вариантов с разными последствиями, но вариант сражаться до последнего вздоха всегда как минимум красив.',
            },
            {
              title: 'Делай как говорю',
              text:
                'Сколько раз в жизни учителя отбивали у тебя желание заниматься каким-либо искусством? Сколько раз учителя выдавали свои ошибки за свои знания, а свои страхи за свою мудрость? Держи от себя на порядочном расстоянии так называемых учителей, а ещё дальше держи тех, кто хочет учить тебя из любви к своему искусству, а не из любви к твоему искусству.',
            },
            {
              title: 'Наш крест',
              text:
                'Торо писал, что не знает ни одного человека, который обладал бы настолько свободным умом, что в его присутствии можно было бы думать вслух. В этом вся твоя жизнь.',
            },
          ],
        },
      ],
    },
    {
      number: '12',
      pages: [
        {
          aphorisms: [
            {
              title: 'Die fröhliche Wissenschaft',
              text:
                'Известная цитата: «Каждый миг живи как последний». Она очень красива и страшна, но от неё мало пользы, потому что в ней умалчивается про годы психологической подготовки, необходимые чтобы проживать каждый миг как последний. Для ищущих экзистенциальной мудрости есть такая цитата:&nbsp;«».',
            },
            {
              title: 'Миры',
              text:
                'Есть много миров: мир материальный, мир внутри тебя, мир внутри каждого другого человека. Есть красота в том, чтобы жить во многих мирах сразу, но есть ли красота в том, чтобы жить только в одном мире?',
            },
            {
              title: 'О красоте',
              text:
                '«Красота в глазах смотрящего» — эту простую истину знает любой художник, фотограф, косплеер, модель и другие люди, для которых образ такой же инструмент, как отвёртка. Если ты считаешь, что ты некрасив, у тебя есть три пути: ничего не делать, изменить свою внешность в сторону красоты или изменить свои вкусы в сторону своей внешности. Заблуждаются те, кто считают, что что-то из этого предпочтительнее другого.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Мотивация предпринимателей',
              text:
                'Предпринимателей уважай за их волю действовать без инструкций, не плыть по течению, рисковать, жить своим делом. Однако не стоит считать, что всё это растёт из воли к власти и прочей жизненной мудрости, часто это растёт из желания быть не как все. Нет особой разницы между желаниями быть как все и быть не как все.',
            },
            {
              title: 'Психотерапия',
              text:
                'Суть психотерапии не в том, чтобы стать терминатором, а в том, чтобы перестать в ней нуждаться.',
            },
            {
              title: 'Happiness',
              text:
                'Культ успеха — проклятие современного мира. Слабохарактерному человечку со всех сторон вдалбливают превозмогать и бежать вверх по карьерной лестнице, заставляя его тем самым страдать и колбаситься как белка в колесе, когда он предпочёл бы позадротить в дотан под чипсики и колу. Скорее всего человечек прострадает так до конца своих дней, в лучшем случае почитает мотивирующих цитат и станет периодически медитировать. Много ли людей счастливы? У многих ли мир с собой? Внутренний покой?',
            },
          ],
        },
      ],
    },
    {
      number: '13',
      pages: [
        {
          aphorisms: [
            {
              title: 'Ok, boomer',
              text:
                'Не стоит считать, что любой бумер обязательно высокомерен, но практика показывает, что представители бумеровв в большей мере склонны к слепоте и высокомерию, чем представители других поколений. В важных вещах стоит держать бумеров на порядочном расстоянии, если они не исключительны. Иксы по сути чуть более молодые бумеры.',
            },
            {
              title: 'Ok, millenial',
              text:
                'Милениалов уважай за то, что они росли в переломное время и во многом подготовили почву для зетов. Можно сказать, что некоторые милениалы в чём-то заменили тебе родителей.',
            },
            {
              title: 'Gen Z, bitch',
              text:
                'Большое счастье быть из поколения зетов. В среднем в зетах гораздо больше свободы и гораздо меньше булщита, чем в старших поколениях.',
            },
            {
              title: 'Adeptus Tiktokus',
              text:
                'Поколение альф — маленькие миленькие покемоши, с которыми у зетов куда больше понимания, чем у любых двух других поколений. Когда зеты недовольны культурой тиктока или вкусом альф в отношении контента на ютубе, зетам следует помнить, что они тем самым становятся ничуть не лучше старших поколений, которые зачастую относились к ним таким же образом.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Надо резать',
              text:
                'Однажды некий шарик появился у тебя под кожей в пальце. Ты пошёл к хирургу, на что хирург сказал: «Надо резать». Ты был не готов резать, поэтому пошёл ещё к терапевту, который сказал так: «Надо мазать». В тот момент ты осознал, что у каждого своя истина, а выбират тебе и расплачиваться тоже тебе.',
            },
            {
              title: 'This book loves you',
              text:
                '«Жить вообще трудно, так чего ты ждёшь от цитаты?» — цитата из книги Пьюдипая.',
            },
            {
              title: 'Аскеты',
              text:
                'Аскетичность уважай тогда, когда она растёт из сильного духа, а не из душевных болезней.',
            },
            {
              title: 'Стилисты',
              text:
                'Стилисты нужны тем, кто хочет выглядеть как принято, как нравится людям, как нравится стилистам. Кто хочет выглядеть как они сами хотят, лучше пусть обращаются к другим специалистам: самим себе.',
            },
            {
              title: 'Психотерапевты',
              text: 'Психотерапевты — герои нашего времени.',
            },
          ],
        },
      ],
    },
    {
      number: '14',
      pages: [
        {
          aphorisms: [
            {
              title: 'Клиентский сервис',
              text:
                'Ильяхов ещё хуй знает когда объяснил всем, что такое клиентский сервис, а компании типа Тиньков-банка показали это на практике. Почему же до сих пор столько уебанского сервиса? Вопрос для самостоятельного изучения.',
            },
            {
              title: 'Больные люди',
              text:
                'Не существует ничего более омерзительного, чем родить ребёнка для себя. Омерзительно также развестись и оставить ребёнка без себя. Взрослые с мерзкими ебалами будут причмокивая рассказывать о том, насколько развод был важен для их ментального здоровья, насколько тебе этого не понять и насколько они тем самым сделали кому-то там лучше, но не существует взрослых, чьи слова о разводе не были бы похожи на потоки гноя, льющиеся из их половых органов.',
            },
            {
              title: 'Сами виноваты',
              text:
                'Безусловное уважение к родителям — иллюзия, от которой быстро освобождаешься, снова и снова расплачиваясь за их ошибки. С безусловной любовью дела обстоят сложнее и проще одновременно: хочешь люби, не хочешь не люби.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Caro mi è il sonno, e più l’esser di sasso',
              text:
                'Ergo Proxy — произведение с большой буквы. В нём все персонажи как родные. Считай это мерилом качества сюжета: все персонажи должны быть как родные.',
            },
            {
              title: 'And you don’t seem to understand',
              text:
                'Serial Experiments Lain — произведение с большой буквы. В отличие от классического трансгуманизма, который показан в Ghost in the Shell, здесь трансгуманизм своего рода эзотерический. Как говорил Шопенгауэр, настоящая задача не в том, чтобы написать о чём-то неизвестном, а в том, чтобы написать о чём-то известном так, как ещё никто не писал.',
            },
            {
              title: 'Новости',
              text:
                'Когда ты последний раз читал новости? Когда отравили Навального. А перед этим? Когда случился коронавирус. А до того? Кажется когда была олимпиада в Сочи.',
            },
          ],
        },
      ],
    },
    {
      number: '15',
      pages: [
        {
          aphorisms: [
            {
              title: 'Кому-то так проще',
              text:
                '«Относись к другим так, как хочешь, чтоб они относились к тебе» — это такое же красивое и больное заблуждение, как и «Каждый миг проживай как последний». Причина в том, что это высказывание создаёт ложное впечатление, будто в ответ люди будут относиться к тебе так, как ты относишься к ним. Для ищущих социальной мудрости есть такое высказывание: «Относись к другим так, как хочешь». Нужно быть человеком не от мира сего, чтобы правильно понять эти слова и понять в первую очередь чего в них не сказано.',
            },
            {
              title: 'Почва',
              text:
                'Марк Аврелий просто и понятно объяснил, почему не стоит искать известности, но важно понимать, что его отношение к известности выросло на той же почве, на которой выросло его убеждение в необходимости достойно блюсти свой гражданский долг. Угадай, что вырастет из семян отношения к известности, если посадить их в почву любви к себе и жизни?',
            },
            {
              title: 'Знаменитости',
              text:
                'Знаменитость — человек, о существовании которого знает больше людей, чем о других людях. Это единственная разница между знаменитостью и тобой.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'В поисках указателей',
              text:
                'Заблуждаются люди, которые говорят, что в жизни нужны цели, принципы, ориентиры, примеры для подражания, вызовы, достижения, захватывающие моменты. Это сложно понять, многие люди не понимают этого всю свою жизнь, но истина очень проста: каждый дрочит на что хочет.',
            },
            {
              title: 'Срок годности',
              text:
                'Читая чужие мысли, особенно философские, помни что у автора всегда есть контекст, который тебе неизвестен. К примеру, Марк Аврелий был императором Рима, отсюда и его склонность блюсти свой долг. Цунетомо Ямамото жил в феодальной Японии, а ценности тех времён поразительно отличались от ценностей современных людей. Проверяй у мыслей не только качество, но ещё и срок годности.',
            },
            {
              title: 'Отцы и дети',
              text:
                'Ницше писал, что философия рождается от праздности, но если праздность мать философии, то отцом является тяжёлый жизненный путь, как и у психотерапии.',
            },
          ],
        },
      ],
    },
    {
      number: '16',
      pages: [
        {
          aphorisms: [
            {
              title: 'Обобщать и упрощать',
              text:
                'Цитата Селинжера: «Некоторые вещи нельзя обобщать и упрощать». В этом великая мудрость, хотя это тяжело понять. Мир сложен. Люди сложны. Очень наивно думать, что что-то можно свести к простым словам, наивно думать что ты что-то понимаешь, особенно людей. Понимаешь ли ты хотя бы себя?',
            },
            {
              title: 'Полезное действие',
              text:
                'Работая, задавай себе вопрос: «Зачем меня наняли?». Редактора никогда не нанимают чтоб он писал текст. Разраба никогда не нанимают чтоб он писал код. Дизайнера никогда не нанимают, чтоб рисовал макет. Компания, которая платит тебе зарплату, является машиной по зарабатыванию денег, а не машиной по удовлетворению твоих фантазий.',
            },
            {
              title: 'Личные границы',
              text:
                'Умей чувствовать, где заканчиваются твои личные границы и начинаются личные границы другого человека. Никогда не лезь другим людям в голову и умей замечать, когда лезут в твою. Тем не менее имей волю снисходительно отнестись к лезущим, если заслуживают. Даже среди достойных людей хватает тех, которые не видят, пока им не покажешь.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Опасные фантазии',
              text:
                'Хидео Кудзе говорил: «Люди плохо понимают друг друга». Никогда в жизни не позволяй себе фантазировать о том, как поведут себя другие люди, что они чувствуют и что у них на уме, за это можно отдать большую плату. Существует искусство обращения с людьми, частями которого являются восприятие, эмпатия и влияние, эти части могут помочь ощутить и почувствовать человека, но никогда не познать его.',
            },
            {
              title: 'I just hate people',
              text:
                'Пинокиопи — гениальный творец. Вряд ли во всей Японии найдётся человек, чья музыка одновременно достаточно глубока и настолько же при том не лишена духа времени.',
            },
            {
              title: 'Your life is the result of your own decisions',
              text:
                'Mind Game — произведение с большой буквы. Если тебе доведётся из всех произведений искусства выбрать одно, которое кратко перескажет всю суть жизни, то выбери его.',
            },
          ],
        },
      ],
    },
    {
      number: '17',
      pages: [
        {
          aphorisms: [
            {
              title: 'Подозрительная истина',
              text:
                'Много сказано о том, что у человека есть только миг, но есть в этой мудрости что-то неестественное. Это некий обман, преступление против порядка вещей. Говорят, что у тебя есть только миг, но как насчёт квартиры, что ты снимаешь? А твоих отношений с людьми? А денег на твоём счету? Твоей работы? Всё это важно для тебя и в некоторым смысле вредно вычёркивать это и говорить, что у тебя есть лишь миг. Люди, кто поможет понять это? Это одна из немногих истин, которую ты пока не понял.',
            },
            {
              title: 'Тихо плыли в звёздной пыли',
              text:
                'Ghost in the Shell: Stand Alone Complex и 2nd GIG — произведения с большой буквы. Можно сказать, что эти произведения сделали тебя тобой. Некоторые вещи нельзя сказать или записать, их можно только почувствовать.',
            },
            {
              title: 'Viva!',
              text:
                'Приятно вспоминать прошлое. Надо сказать, что в нём хватает и тёмных страниц, но что с того? Светлое, тёмное, хорошее, плохое — живи и будь частью всего этого.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Анкеты',
              text:
                'Большая наивность считать, что человека можно свести к выбору из нескольких вариантов. Можно дать человеку текстовое поле, но тогда нужно помнить, что ты смотришь на него через текстовое поле.',
            },
            {
              title: 'You’re gonna carry that weight',
              text:
                'Cowboy Bebop — произведение с большой буквы. Не существует способа сделать это произведение лучше, чем оно есть.',
            },
            {
              title: 'No less, walk on earth, water and fire',
              text:
                'Samurai Champloo — произведение с большой буквы. Оно как Cowboy Bebop, но если добавить больше истории и культуры.',
            },
            {
              title: 'Who cares baby',
              text:
                'Space Dandy — произведение с большой буквы. Оно как Cowboy Bebop, но если бы он вышел не в 1998, а в 2014.',
            },
          ],
        },
      ],
    },

    {
      number: '18',
      pages: [
        {
          aphorisms: [
            {
              title: 'Не сотвори себе кумира',
              text:
                'Однажды тобой восхитились так, как восхищаются идолами. Это было настолько мерзко, что ты решил больше никогда в жизни не сотворять себе кумиров, чтоб не было риска доставить им неприятность тоже испытать это мерзкое чувство.',
            },
            {
              title: 'Куда уж тебе',
              text:
                'Как смешно бывает, когда кто-нибудь говорит «Тебе не понять этого». Ты помнишь хоть один случай, когда ты не смог чего-то понять? На завтрак у тебя Ergo Proxy, на обед Beyond Good and Evil, а на ужин Europa Universalis, но тем не менее люди думают, что есть что-то, что ты не сможешь понять.',
            },
            {
              title: 'Neva give up',
              text:
                '«Никогда не сдавайся» — так говорят многие. Но ты говори так: «Знай когда сдаваться и знай как сдаваться, потому что сдаваться тоже нужно уметь». Нет ничего сложного в том, чтобы впрячься в плуг и протащить его через поле, но нет ничего сложнее чем остановиться и спросить себя, почему ты тащишь этот плуг и почему спрашиваешь себя об этом.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Нигилисты',
              text:
                'Многие люди используют нигилизм в качестве прикрытия своей слабохарактерности. Религиозный нигилизм переживает тяжёлые времена, но вместо него появился цифровой нигилизм в лице интернета с бесконечным океаном развлечений. Как писал Ирвин Ялом, в наше время никто не умирает от горьких истин, потому что слишком велик выбор противоядий. Ты часто советуешь: люби себя и делай что хочешь, но для девяти из десяти это означает не вставать с кровати или не отходить от компьютера. Жаль, но что тебе до них? Ищи людей других.',
            },
            {
              title: 'Дружба',
              text:
                'Существует много видов дружбы: дружба равных, дружба лучшего и худшего, дружба лучших, дружба худших, дружба врагов, дружба влюблённых, дружба противоположностей, дружба двух капель воды, больная дружба. Всякая дружба красива.',
            },
            {
              title: 'Будущее',
              text: 'Что можно сказать о будущем? Кто знает!',
            },
          ],
        },
      ],
    },
    {
      number: '19',
      pages: [
        {
          aphorisms: [
            {
              title: 'Православная гимназия',
              text:
                'Родители отдали тебя в православную гимназию, ошибочно полагая, что там у людей души светлые, но на деле всё оказалось наоборот: дети священников выбирали себе жертв из числа обычных детей и издевались над ними. Девочку, которая верила в домовых, обзывали ведьмой. Девочку, поцеловавшую мальчика, гнобили развратницей. Мальчику из небогатой семьи собирали объедки со всей столовой и торжественно подносили на тарелке. А что ж учителя? Учителя либо испытывали благоговейный страх перед детьми священников, либо сами не отличались здоровым рассудком. Хороши светлые души!',
            },
            {
              title: 'Третья гимназия',
              text:
                'Родители отдали тебя в третью гимназию из благих побуждений. На тот момент она была самой новой и самой современной в Белгороде, но как писал Селинжер, чем дороже школа, тем больше в ней хулиганья. Твои родители умудрились не знать и про это, возможно хватило евроремонта, чтоб ослепить их. В третьей гимназии девочки прятали твои вещи, а мальчики звали драться на стрелки. Помнишь то чувство дикого страха, которое ты испытывал, когда шёл по коридорам и боялся наткнуться на гопоту? Но для правды надо сказать, что среди учителей здоровых людей было примерно на три человека больше, чем в православной гимназии.',
            },
            {
              title: 'Индустриальный колледж',
              text:
                'Русский колледж бессмысленный и беспощадный. Студенты колледжей это обычно те, кто не смог попасть в вышку, в большинстве случаев гопота. Конечно же, твои родители и этого тоже не понимали, когда отдавали тебя туда. Почему они этого не понимали? Почему ты был таким послушным? Но надо признать: твои товарищи были хорошими людьми. Многие из них попали в колледж по той же ошибке, что и ты.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Вышка',
              text:
                'Вышка для многих профессий бесполезна, но профессия — это не то зачем стоит идти в вышку. Вышка — это социальный статус, и не только позволяющий легче уехать в другую страну, но и другой — студенческий. Студентам открыты многие дороги, а самая волшебная из них — дорога молодых тусовок среди ровесников и ровесниц. Люди бывают всякие, но на работе круг знакомых тебе людей в среднем сильно меньше, чем в универе или институте или подобном заведении. Работа не волк, в отличие от молодости.',
            },
            {
              title: 'Семья',
              text:
                'Семья должна быть союзом творцов, желающих своим творчеством обогатить мир. Здесь важно не то, что сказано, а то, чего не сказано.',
            },
            {
              title: 'Провинция',
              text:
                'Жить в провинции лютый тлен, но не из-за того что там грязно и некрасиво, а из-за того что там душно.',
            },
          ],
        },
      ],
    },

    {
      number: '20',
      pages: [
        {
          aphorisms: [
            {
              title: 'There are no accidents',
              text:
                'Ницше верно заметил, что случайностей не существует, потому что существование случайностей возможно только при наличии цели, предназначения, плана. Всё что не идёт по плану — то случайность, но есть ли план у бытия? Не существует случайностей в привычном смысле, всё происходящее является случайностью.',
            },
            {
              title: 'Границы стоицизма',
              text:
                'Стоицизм как лекарство прописан людям нервным, думающим, волнующимся, но для по-настоящему глубокого человека стоицизм напоминает детскую ванночку. Чем больше тянешься к истине, тем больше пустоты в душе и тем сильнее отчаяние. Стоицизм не поможет совладать и с десятой частью этого отчаяния, но он отлично помогает общаться с мудаками, встречать критику, переносить тяготы жизни. Стоицизм — достойный первый шаг для философов, но если они захотят настоящей истины, то им не стоит ожидать от стоицизма сверх того, что он может дать.',
            },
            {
              title: 'Музыка',
              text:
                'Музыка — великое искусство. Как писал Ницше, без неё жизнь была бы ошибкой. Но было бы совсем замечательно, если б твои любимые музыканты реже умирали. Нуджабес, Орига, Авичи, Вовака, скольких ещё ты похоронишь? ',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Справедливость',
              text:
                'Когда ты был молод, ты любил справедливость и правосудие, но потом тебя изменила десятая серия второго сезона «Синдрома одиночки» — «Праведная злость». Надо сказать, что если бы тебе повезло попасть в их мир, то ты бы не раздумывая стал Тогусой. От первой секунды первого сезона и до последней секунды «Закостенелого общества» ты полностью понимал Тогусу и был полностью с ним согласен во всех его делах. В конце серии кто-то из персонажей говорит, что справедливость в понимании Тогусы вещь в чём-то ненужная, возможно даже невозможная, но как кажется сказал Арамаки, «боги могут устроить возмездие».',
            },
            {
              title: 'Мотивация воркаутов',
              text:
                'Пьюдипай в свойственной ему манере расставил точки над и: качайся не для красоты или здоровья, качайся для Мишимы и Гомера, качайся чтобы убежать от абстрактных понятий, таких как время и смерть. Это сложно понять, но когда понимаешь, становишься другим человеком.',
            },
            {
              title: 'Цветные волосы',
              text:
                'Существуют ли люди с цветными волосами, у которых хорошие отношения с родителями, нет ментальных болезней и детских травм?',
            },
          ],
        },
      ],
    },

    {
      number: '21',
      pages: [
        {
          aphorisms: [
            {
              title: 'Горькая истина',
              text:
                'Бывают люди, которые годами не знают никаких отношений. Бывают люди, которые предпочитают гомосексуальные, бисексуальные, свободные, полиаморные и другие отношения. Это всё люди одной болезни. Многих болезнь скрючила, другие дали ей бой и разогнулись настолько, что стали мало отличаться от скрюченных. Не скоро тебе встретится человек, который убедит тебя, что нетрадиционное отношение к отношениям рождается не из душевных болезней. Однако ещё дольше тебе ждать встречи с человеком, который бы убедил тебя, что где-то существуют люди без болезней. И уж совсем никогда тебе не встретится человек, который убедит тебя в том, что плохо быть больным человеком и хорошо быть здоровым и наоборот.',
            },
            {
              title: 'Царица всех наук',
              text:
                'Говорят что математика царица всех наук, но как верно заметил Кант, самой древней наукой является метафизика, поэтому наибольшее благородство в размышлениях метафизических, чем в каких-либо других. Однако, любые размышления выглядят рахитно перед танцем, песней и музыкой.',
            },
            {
              title: 'B☆RS',
              text:
                'Нельзя сказать что Black Rock Shooter — произведение с большой буквы, но есть в нём то, что явно заслуживает похвалы: очень тонкое ощущение человеческих душ и их внутренних миров. Это произведение напоминает Ping Pong Юасы, но конечно не имеет столько художественной ценности.',
            },
          ],
        },
        {
          aphorisms: [
            {
              title: 'Send in the clowns',
              text:
                'Joker — произведение с большой буквы. Любопытно, что под каждым клипом из этого фильма найдётся по меньшей мере один памятник отсутствующим яйцам: некий человек скажет, что в детстве мы любили героев, а став взрослыми стали понимать злодеев. Почему нельзя было искренне сказать, что став взрослыми, мы стали любить злодеев?',
            },
            {
              title: 'Мораль',
              text:
                'Не будь слишком моральным — так советовал Торо, потому что мораль часто встаёт на пути блага. Ницше шагнул дальше и посоветовал создать свою мораль, чтоб не понадобилось распинаться перед теми, кто мешает тебе нести благо.',
            },
            {
              title: 'Путешествия',
              text:
                'Путешествия — благородное занятие, но не благороднее странствий. А разница простая: путешествующий человек шествует по пути, странствующий человек странствует.',
            },
          ],
        },
      ],
    },
  ],
}

export default {
  layout: 'book',
  components: {
    Page,
    Spread,
    Aphorism,
  },
  data() {
    return {
      contents,
    }
  },
  head() {
    return {
      title: '',
      meta: [
        {
          hid: 'description',
          name: 'description',
          content: '',
        },
      ],
    }
  },
}
</script>
