<template>
  <div id="the-dragonrider-and-the-witch">
    <Spread>
      <Page>
        <Paragraph
          inner="Драконий всадник летел в небе посреди туч и грозовых разрядов. Дракон ёрзал и рычал, всадник был сильно напуган, в любой момент в них могла ударить молния. Обычно всадники не летают в грозу, но эта гроза началась совершенно магически и застала всадника врасплох. Буквально за полминуты голубое небо стало серым, а облака стали тучами."
          no-indent="true"
          with-initial="true"
          leadin-size="2"
        />
        <Paragraph
          inner="Здравый смысл требовал от всадника нырнуть куда-нибудь вниз, приземлиться и переждать грозу, но нырять было некуда: под ними были не небеса, а настоящая пустота. Известно, что в определённых местах в пространстве парят летающие острова, но под ними находится пустота, природу которой никто не знает. Упавшие или спустившиеся туда на драконах не возвращались, поэтому вниз пути не было. Гроза застала всадника пока он летел между островами, теперь ему предстояло пролететь ещё несколько минут, пока он не сможет приземлиться и укрыться от гроз. Не исключено, что сверху были и другие летающие острова и можно было долететь до них, но это было бы тяжелее для дракона и непонятно сколько времени это потребовало бы, а ближайший остров спереди уже должен был вот-вот появиться."
        />
      </Page>
      <Page></Page>
    </Spread>

    <Spread>
      <Page>
        <Paragraph
          inner="С неба что-то падало. Казалось, что это был человек. Он летел вниз камнем, видимо сорвавшись с одного из верхних островов. Всадник не заметил этого, потому что ему хватало своих проблем, но дракон поднял глаза и уставился наверх. Всадник заметил направление взгляда дракона и заметил падающего человека. Всадник подумал:"
        />

        <Paragraph inner="«Как жаль, чья-то жизнь вот-вот оборвётся»." />

        <Paragraph
          inner="Всадник с горечью продолжил лететь вперёд, наблюдая как падающий человек всё приближается и вот-вот пролетит мимо них."
        />

        <Paragraph
          inner="Всадник колебался. Здравый смысл требовал бездействовать. Причина в том, что если подставить спину дракона под падающего человека, то скорее всего человек при ударе сломает себе кости. Если подставить седло, то человек вероятно сломает ещё и кости всадника. Если подставить голову дракона, то дракон может потерять сознание от удара. Если попытать поймать падающего на крылья дракона, то можно порвать их, в результате чего дракон рискует потерять способность летать. Нельзя исключать ещё что падающий может очень много весить, к примеру из-за брони, он также может быть вооружён мечом или другим оружием, которое может ранить дракона."
        />

        <Paragraph
          inner="Возможно единственный способ поймать падающего — это направить дракона вниз и попытаться схватить человека, пролетев рядом с ним. Это очень опасно, потому что ныряние вниз провоцирует то, что всадники называют перегрузкой. От перегрузки в глазах темнеет, потом пропадает зрение, а потом всадник теряет сознание. Обычно сама потеря сознания не наносит вреда здоровью всадника, но контроль над ситуацией оказывается передан дракону, а дракон всего лишь животное. Обычно если всадник теряет сознание, обученные драконы начинают делать круги на месте, приземляться на ближайший остров или улетать домой в безопасность, но часто бывает что инстинкты берут верх и дракон начинает вместо этого охотиться или наоборот становится жертвой чьей-то охоты. Часто бывает, что по пути в безопасное место дракон так много ныряет и так резко взлетает, что бессознательный пилот постоянно находится под перегрузками и уже никогда не приходит в сознание, а если и приходит, то становится немощным, теряет способность двигать конечностями, говорить и понимать происходящее."
        ></Paragraph>
      </Page>
    </Spread>

    <Spread>
      <Page>
        <Paragraph
          inner="«Пусть получится». Всадник напряг всё тело и вместе с драконом нырнул вниз. Сначала перегрузка была небольшой и всадник направлял ныряющего дракона таким образом, чтобы поровняться с человеком и схватить его своими руками. Внезапно всадник понял, что в глазах серые уже не только облака, но и дракон и седло: перегрузка брала своё, глаза уже почти ничего не видели, сознание начинало покидать всадника. Всадник собрал в кулак последние осколки сознания, крикнул дракону «ПОЙМАЙ ЕГО» и натянул поводья таким образом, чтобы дракон понял, что от него требуется схватить человека лапами. После этого всадник потерял сознание."
        ></Paragraph>
      </Page>
      <Page></Page>
    </Spread>
  </div>
</template>

<script>
import Page from '@/components/book/Page.vue'
import Spread from '@/components/book/Spread.vue'
import Paragraph from '@/components/Paragraph.vue'

export default {
  layout: 'book',
  components: {
    Page,
    Paragraph,
    Spread,
  },
}
</script>
