<template>
  <div id="to-self">
    <Spread>
      <Page>
        <Heading3 inner="For the love of it" />
        <Paragraph
          inner="Не существует добра и зла, рая и ада, бога и дьявола, чёрного и белого, правильного и неправильного. Существуют мнения, намерения, действия, последствия. Пусть твои действия будут продиктованы твоей любовью."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Прокрастинация нежеланного"></Heading3>
        <Paragraph
          inner="Когда какое-то дело просит тебя заставлять себя делать его, помни что скорее всего это происходит по той причине, что ты делаешь что-то нежеланное для тебя. Много раз в жизни ты пытался начать качаться из приличия или желания подражать другим, но не бросить ты смог только тогда, когда всей душой полюбил своё тело и стал чувствовать счастье от заботы о нём и от взаимопонимания между телом и душой."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3
          inner="Will they hold the wall or will the city fall?"
        ></Heading3>
        <Paragraph
          inner="Исход сражения известен до его начала, иначе не бывает. Понять это невозможно, это возможно только прочувствовать: крылатые гусары не разворачивают стол, они показывают как он стоит. Помни и другое: кого ебёт исход сражения? Беспокойся о победах и поражениях только тогда, когда твоя любовь к ним сильнее любви к сражению."
          no-indent="true"
        />
      </Page>
      <Page>
        <Heading3 inner="F.I.L.O."></Heading3>
        <Paragraph
          inner="Knowledge of self shines brighter than all — так сказал Шинго Аннен."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Конец нигилизма"></Heading3>
        <Paragraph
          inner="Позади бесконечность, впереди бесконечность. Глядя на них понимаешь, насколько заблуждаются люди, видящие смысл жизни в славе, богатстве, влиянии, семьях, религиях, добродетелях, саморазвитии, благотворительности, но только если это продиктовано внешним, а не внутренним. Если какие-то люди скажут тебе, что в их случае это продиктовано внутренним, нужно ещё переспросить их: «А внутри оно откуда появилось?» И в этом смысле легко поддаться нигилизму, но есть от него лекарство: ницшеанство. «Что сделано из любви, то всегда находится по ту сторону добра и зла»."
          no-indent="true"
        />
      </Page>
    </Spread>

    <Spread>
      <Page>
        <Heading3 inner="Навязчивый буддизм" />
        <Paragraph
          inner="Есть большая разница между счастьем и удовольствием. Есть большая палка для тех, кто захочет убедить тебя в том, что что-то из этого важнее другого."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Ненавязчивый буддизм" />
        <Paragraph
          inner="Между болью и страданием такая же разница, как между удовольствием и счастьем."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="The abyss gazes also into you" />
        <Paragraph
          inner="Есть красота в том, чтобы коснуться души человека и почувствовать, как мало в ней пустоты в сравнении с твоей. Встречал ли ты когда-нибудь человека, в чьей душе было бы столько же пустоты?"
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Ответ содержится в вопросе" />
        <Paragraph
          inner="Ты спросишь: «В чём смысл жизни, почему никто не может дать мне ответа?» Я скажу: «Потому что это не вопрос, который ты задаёшь жизни, а вопрос, который жизнь задаёт тебе»"
          no-indent="true"
        />
      </Page>
      <Page>
        <Heading3 inner="Благодарность православной гимназии" />
        <Paragraph
          inner="Когда ты пошёл в первый класс и впервые в жизни окунулся в общество, твои одноклассники вели себя настолько по-свински, что у тебя не возникло ни малейшего желания быть как все. Ты пронёс это через всю жизнь вплоть до нынешнего момента: ни разу в жизни ты не пил, ни разу не курил, ни разу не кололся. Ты привык быть не как все, это стало твоей натурой, но в какой-то момент ты понял, что это не только сильная сторона, но и слабость. В следующий момент ты подумал: «И что?» После этого ты подумал: «Я люблю себя таким, поэтому я хочу быть таким и дальше». Как писал Набоков, «Меня у меня не отнимет никто»."
          no-indent="true"
        />
      </Page>
    </Spread>
    <Spread>
      <Page>
        <Heading3 inner="Me, myself and I" />
        <Paragraph
          inner="«Самый великий дар, который ты можешь подарить, это твоё искреннее я». Так говорил Фред Роджерс."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Мы с тобой одной крови" />
        <Paragraph
          inner="Помни, что люди — это комки страхов, ошибок, слабостей. Бывают люди, которые выглядят как супермены, но не стоит считать, что они на самом деле супермены, часто они просто хорошо создают такое впечатление в глазах тех, кто верит в суперменов. Познакомься с десятком суперменов и узнаешь, что между вами нет особой разницы. Стань суперменом для кого-то и поймёшь, насколько бессмысленно верить в суперменов."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Молодым везде у нас дорога" />
        <Paragraph
          inner="Генри Торо писал: «Возраст годится в наставники не больше, если не меньше, чем юность, ведь он не столькому научился, сколько утратил». Мудрость этих слов невъебическая, научись должным образом относиться ко всем желающим поучить тебя жизни, особенно если они старше тебя и тем более если они старее тебя."
          no-indent="true"
        />
      </Page>
      <Page>
        <Heading3 inner="Паладин священной святости" />
        <Paragraph
          inner="Высоко цени в человеке волю иметь в работе принципиальное мнение и идти против того, как делают все вокруг. Много кто скажет что есть большая глупость в принципиальности в работе, но из их числа прислушивайся только к тем, которые не боятся быть уволенными."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Whatever lets you sleep at night" />
        <Paragraph
          inner="Кто-то не считает денег, у кого-то тёплые отношения, кого-то любят во всём мире, кто-то пронзает небеса своими делами — в таком окружении невольно начинаешь сравнивать себя с другими и испытывать неудовольствие от этого, но с обретением внутреннего покоя понимаешь, что it’s all the same shit."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="Наши желания не всегда совпадали" />
        <Paragraph
          inner="Большое счастье общаться с людьми, которые смотрят на мир иначе. Счастье также общаться и с теми, которые смотрят на мир во многом как ты."
          no-indent="true"
        />
      </Page>
    </Spread>
    <Spread>
      <Page>
        <Heading3 inner="" />
        <Paragraph
          inner="Есть большая красота в том, чтобы умножить на ноль более слабого противника. Нанося сокрушительное поражение более слабому противнику, ты проявляешь любовь к нему, ты даёшь ему возможность коснуться своего искусства, надеясь что возможно он чему-то научится и станет лучше в его искусстве."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Одна из важнейших мудростей: слушай советов только тех, на кого хочешь быть похожим. Помни ещё, что чем мудрее человек, тем менее он склонен давать советы. И ещё помни: люди бывают ебанутыми."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Есть большая красота в том, чтобы сражаться с равным противником ноздря в ноздрю. Вселенная замирает и время изменяет своё русло, когда сражаются два равных противника."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Марк Аврелий писал, что ни один человек не может сделать тебе зла, потому что ни один человек не может сделать тебя в меньшей мере частью естества, чем ты был до этого. Это трудно понять, но когда понимаешь, то жизнь становится легче и приятнее."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Фред Роджерс любил людей такими, какие они есть, и в этом его великая мудрость."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Есть большая красота в том, чтобы сражаться до последней капли крови. Иногда ты оказываешься в ситуации, в которой ты не сможешь победить. Что делать в такой ситуации — твой выбор, но если ты решишь сражаться до последнего вздоха, то я склоняюсь пред твоим выбором."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Сколько раз в жизни учителя отбивали у тебя желание заниматься каким-либо искусством? Сколько раз учителя выдавали свои ошибки за свои знания, а свои страхи за свою мудрость? Держи от себя на порядочном расстоянии так называемых учителей, а ещё дальше держи тех, кто хочет учить тебя из любви к своему искусству, а не из любви к твоему искусству."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Есть большая красота в том, чтобы уметь любить своих врагов и уметь ненавидеть своих друзей."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Один из главных секретов счастья: не имей ожиданий. Когда ты ожидаешь от человека каких-то действий, ты совершаешь преступление против красоты мира."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Торо писал, что не знает ни одного человека, который обладал бы настолько свободным умом, что в его присутствии можно было бы думать вслух. В этом вся твоя жизнь."
          no-indent="true"
        />
        <Spacer size="one-line" />

        <Heading3 inner="" />
        <Paragraph
          inner="Когда ты спрашиваешь у людей советов, помни что их советы лишь мнения, а не инструкции к действию. Помни также, что эти люди не знают ситуацию и на десятую часть от того, насколько её знаешь ты, ведь они не ты и у них за плечами нет твоего жизненного пути и твоих взглядов, им доступны лишь несколько капель от того океана, который на самом деле тебя окружает. В ответ на просьбу посоветовать люди станут воображать, а ты станешь слушать их воображения, оценивать насколько они тебе милы и согласишься ли ты взять какие-то кусочки их воображений на вооружение."
          no-indent="true"
        />
      </Page>
      <Page></Page>
    </Spread>
  </div>
</template>

<script>
import Page from '@/components/book/Page.vue'
import Spread from '@/components/book/Spread.vue'
import Paragraph from '@/components/Paragraph.vue'
import Heading3 from '@/components/Heading3.vue'
import Spacer from '@/components/Spacer.vue'

export default {
  layout: 'book',
  components: {
    Page,
    Spread,
    Paragraph,
    Heading3,
    Spacer,
  },
}
</script>
